import { Main, Goals, Works, TypeWorks, CardsBlocks, CardsBlockImg } from './HistoryPage.styled';

import {
  Container,
} from 'components';

import img from 'image/OurGoal1.jpg';
import img2 from 'image/OurGoal2.jpg';
import img3 from 'image/OurGoal3.jpg';
import img4 from 'image/OurGoal4.jpg';
import img5 from 'image/OurGoal5.jpg';
import img6 from 'image/OurGoal6.jpg';
import img7 from 'image/OurGoal7.jpg';
import img8 from 'image/OurGoal8.jpg';
import img9 from 'image/OurGoal9.jpg';
import img10 from 'image/OurGoal10.jpg';
import img11 from 'image/OurGoal11.jpg';

export default function HistoryPage() {
  window.scrollTo({
    top: 0,
    left: 0,
  })

  return (
    <Main>
      <Container>
        <Goals>
          <h2>Наша головна мета</h2>
          <p>
            об'єднати зусилля з іншими організаціями та небайдужими людьми для надання
            психологічної, соціальної, гуманітарної допомоги сім'ям з дітьми та іншим вразливим
            верствам населення, що постраждали через війну в Україні.
          </p>
        </Goals>

        <Works>
          <h2>Напрямки роботи</h2>
          <p>
            Наша команда поставила перед собою завдання/задачу забезпечити всім необхідним та надати
            гуманітарну допомогу населенню Харкова та Харківської області.
          </p>
        </Works>

        <TypeWorks >
          <CardsBlocks>
            <CardsBlockImg >
              <img src={img} alt="children" />
            </CardsBlockImg>
            <h3>Психологічна підтримка та проведення занять для дітей</h3>
            <section>
              Розвивальні заняття з професійними педагогами, реабілітаційні заходи та надання
              психологічної допомоги дітям, які постраждали внаслідок ворожих дій.
            </section>
          </CardsBlocks>

          <CardsBlocks >
            <CardsBlockImg >
              <img src={img2} alt="people" />
            </CardsBlockImg>

            <h3>Допомога населенню деокупованих територій</h3>
            <section>
              Відвідування декілька разів на місяць, надання продуктової та матеріальної допомоги -
              одягу, засобів особистої гігієни, сірників, свічок, ліхтариків, корму для тварин.
            </section>
          </CardsBlocks>
          <CardsBlocks >
            <CardsBlockImg >
              <img src={img3} alt="dog" />
            </CardsBlockImg>
            <h3>Допомога тваринам</h3>
            <section>
              Надання корму та засобів для догляду за тваринами, які опинились на вулиці, а зараз
              прилаштовані у міні – притулки мешканцями селищ.
            </section>
          </CardsBlocks>
        </TypeWorks>


        <Works>
          <h2>Історія фонду</h2>
          <p>
            З перших днів війни на базі дитячого розвиваючого центра “Арбуз”, зусиллями
            співробітників та їхніх родин був організований центр волонтерської допомоги, який в
            подальшому став благодійним фондом "A-Help Ukraine”. Ми хочемо познайомити вас з
            історією фонда трохи детальніше<strong> Ми хочемо познайомити вас з історією фонда трохи детальніше</strong>
            <div >
              <img src={img4} alt="factory" />
            </div>
            <strong> Один ранок змінив життя мільйонів людей.</strong>
            <p>
              Вибухи! Війна!  <br /> Замість того, щоб розпочати
              свій робочий день – люди були змушені лишити свої будинки та їхати. Хто куди… Без
              нічого… Багатьом виїхати не вдалося, і тисячі людей залишились у зоні бойових дій, де
              щодня йдуть обстріли, руйнуються будинки та переривається  життя…
            </p>
          </p>
        </Works>



        <div>
          <CardsBlockImg>
            <img src={img5} alt="old people" />
          </CardsBlockImg>
          <span>
            Постала гостра потреба надавати людям допомогу у вигляді продуктів харчування, ліках,
            засобах особистої гігієни, засобах для догляду за дітьми та багато іншого <br /><strong>Людям була
              потрібна підтримка та психологічна допомога.</strong>
          </span>
        </div>

        <div className="OurGoal__img-discription">

          <span>
            Нас розкидало по містах, але <strong>ми змогли створити та організувати роботу команди,</strong> де кожен
            намагається забезпечити максимальну користь для жителів міста Харкова, яке дуже сильно
            постраждало від ракетних ударів.
          </span>
          <div>
            <img src={img6} alt="old people" />
          </div>
        </div>
        <div className="OurGoal__img-discription">
          <div>
            <img src={img7} alt="old people" />
          </div>
          <span>
            До волонтерської команди “A-help” потрапили люди різних спеціальностей, які об'єднали
            свої зусилля та знання. <strong> Команда ставить перед собою найскладніші завдання</strong> зі збирання
            інформації, пошуку благодійних організацій, закупівлі товарів першої необхідності,
            організації трансферу та доставки гуманітарної допомоги населенню.
          </span>
        </div>
        <div className="OurGoal__img-discription">

          <span>
            <strong> Одразу були організовані кухні,</strong> на яких наші безстрашні жінки – волонтери готували
            гарячу їжу щоб нагадувати старих, дітей та їхніх батьків, які перебували у підвальних
            приміщеннях та не мали можливості приготувати їжу. Кожен день наші волонтери  <strong> роздавали
              гарячі обіди, свіжий хліб, молочні продукти.</strong>  Також, ми роздавали значну кількість
            <strong> засобів особистої гігієни, дитячих іграшок, важливих ліків та одяг.</strong>
          </span>
          <div>
            <img src={img8} alt="old people" />
          </div>
        </div>
        <div className="OurGoal__img-discription">
          <div>
            <img src={img9} alt="old people" />
          </div>
          <span>
            Протягом усіх місяців воєнної агресії наша команда  <strong> надає допомогу мешканцям Харкова,
              селища Жуковського, переселенцям у Харківській області та людям на деокупованих
              територіях. </strong> <br /> <strong>Наш центр </strong> розташований в одному з найбільш постраждалих від російської
            агресії районів Харкова. <br /> <strong> Селище Жуковського </strong> є одним із самих найзатишніших районів міста
            з великою кількістю населення. І також дуже потребує лікування ран після обстрілів та
            особливої підтримки.
          </span>
        </div>
        <div className="OurGoal__img-discription">

          <span>
            <strong> Нещодавно поблизу нашого центру вибухнула ракета.  </strong>  У нашому приміщенні зараз немає вікон,
            зруйновані стіни. Перед нами стоїть дуже  <strong> термінова задача з ремонту, </strong> бо це приміщення не
            тільки пункт прийому та видачі гуманітарної допомоги, але і облаштований дитячий центр,
            у якому проходять заняття для малечі. Якщо ми не відремонтуємо ці жахливі наслідки, то
            <strong> ми не зможемо працювати.</strong>  Саме тому, ми збираємо кошти на ремонт приміщення. Ви можете
            допомогти нам донатами <strong>за посиланням на головній сторінці.</strong>
          </span>
          <div>
            <img src={img10} alt="old people" />
          </div>
        </div>
        <div className="OurGoal__last-block">
          <div>
            <img src={img11} alt="old people" />
          </div>
          <span>
            <strong>Кожного дня без вихідних ми продовжуємо працювати заради майбутнього нашого міста, нашої
              країни! </strong> <br /> Попереду багато планів та задач, які ми обов’язково повинні виконати, бо
            вважаємо цю роботу обов’язком кожного – надавати допомогу якомога більшій кількості
            людей у цей важкий для нашої країни час. У такий момент дуже важливо об'єднуватися і
            допомагати один одному, тому що чим більше буде бажаючих допомогти – тим більше
            можливості врятувати життя та перемогти!
          </span>
        </div>


      </Container>
    </Main>
  );
}
